Revit 2026 API

# SunAndShadowSettingsStartDateAndTime Property

---

Identifies the start or current date and time.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public DateTime StartDateAndTime { get; set; }
```
```vb
Public Property StartDateAndTime As DateTime
	Get
	Set
```
```cpp
public:
property DateTime StartDateAndTime {
	DateTime get ();
	void set (DateTime value);
}
```
```fsharp
member StartDateAndTime : DateTime with get, set
```

#### Property Value

DateTime The date and time. The output value will be in Coordinated Universal Time (UTC), but input may be in local time as well.

| Exception | Condition |
| --- | --- |
| ArgumentException | When setting this property: Revit does not accept input DateTime objects if they are of kind DateTypeKind.Unspecified. |

This property represents the start time for a single-day or multi-day study, or the current time for a still sun study. Note that Revit may ignore this value if the SunriseToSunset flag is set.

#### Reference

SunAndShadowSettings Class

Autodesk.Revit.DB Namespace